Ejemplos de funcionamiento

desde el router 5 importo el route-target 1:100, que es exportado por el Router 3 y solo le llego desde la vrf en la cual lo importo

R5#sh ip route vrf shared

Routing Table: shared
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      10.0.0.0/8 is variably subnetted, 4 subnets, 2 masks
B        10.3.3.1/32 [200/0] via 10.1.1.3, 00:38:56
C        10.5.5.5/32 is directly connected, Loopback5
B        10.50.1.0/30 [200/0] via 10.1.1.3, 00:38:56
B        10.99.1.1/32 [200/27008000] via 10.1.1.3, 00:35:04

R5#ping 10.3.3.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.3.3.1, timeout is 2 seconds:
.....

R5#ping vrf shared 10.3.3.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.3.3.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 28/61/84 ms

Segundo Caso

En el router 6 tengo las vrf servicios y servers
R6#sh ip route vrf servicios

Routing Table: servicios
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
B        10.2.2.1/32 [200/0] via 10.1.1.1, 00:52:21
C        10.2.2.6/32 is directly connected, Loopback10
B        10.3.3.1/32 [200/0] via 10.1.1.3, 00:52:21
B        10.50.1.0/30 [200/0] via 10.1.1.3, 00:52:21
B        10.99.1.1/32 [200/27008000] via 10.1.1.3, 00:48:39

veo las IP que importo, segun el route-target import y son solo accesibles desde la misma vrf
R6#ping vrf servicios 10.2.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.2.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 96/110/128 ms
R6#ping 10.2.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.2.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)

